Identifier: local.recipe.intune.AmazonCLI
Input:
  NAME: Amazon CLI
  categories:
  - Productivity
  description: The AWS Command Line Interface (CLI) is a unified tool to manage your
    AWS services, symlinked into your path at /usr/local/bin/aws
  developer: Amazon Web Services
  display_name: Amazon CLI
ParentRecipe: com.github.almenscorner.intune.AmazonCLI
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.almenscorner.intune-upload.processors/IntuneAppUploader:
      git_hash: 3490c79b8279cea017c399c16354e27edf040a28
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppUploader.py
      sha256_hash: 808212feb5e67a3af6fff5cfeec3c2392e6658badaa3b46f924ca8eea8b012c7
  parent_recipes:
    com.github.almenscorner.intune.AmazonCLI:
      git_hash: 5734bb31a8c9c76e1dc95f03c74e6eadb2594128
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/Amazon
        CLI/AmazonCLI.intune.recipe
      sha256_hash: 064f2ad16803bea657b68306aacaedc2c34c3a4da68de785496e813273a679c6
    com.github.homebysix.download.AWSCLI:
      git_hash: b76a7d0419c0f028ed9275c474dbf7faf846fb40
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Amazon/AWSCLI.download.recipe
      sha256_hash: a378a70d339946beb7b9f521a2848f3c21e40e168789b8f9ab554cee1853e544
