Identifier: local.recipe.intune.Docker
Input:
  NAME: Docker
  PLATFORM_ARCH: arm64
  categories:
  - Development & Design
  description: "Docker Desktop \u2013 the fastest way to containerize applications."
  developer: Docker
  display_name: Docker Desktop
ParentRecipe: com.github.almenscorner.intune.Docker
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter:
      git_hash: d4b10043288978db1f1168ac3b6c841076c4558b
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppIconGetter.py
      sha256_hash: e3060bf0e15bd9ad9c5877805c0dcbb7b3732e1891b654ece10c4f35987c7216
    com.github.almenscorner.intune-upload.processors/IntuneAppUploader:
      git_hash: 3490c79b8279cea017c399c16354e27edf040a28
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppUploader.py
      sha256_hash: 808212feb5e67a3af6fff5cfeec3c2392e6658badaa3b46f924ca8eea8b012c7
  parent_recipes:
    com.github.almenscorner.intune.Docker:
      git_hash: bb54f0e9ec08a805b04d7a0bacb71abbdccc2505
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/Docker/Docker.intune.recipe
      sha256_hash: 456ef0f3a56c02c001bf137090203c4e3e8f1a29f10b6150ac501a2638f59620
    com.github.homebysix.download.DockerDesktop:
      git_hash: 62821b481086db4e4d6db38e0cb36e58b9b93612
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Docker/DockerDesktop.download.recipe
      sha256_hash: 3b48e283992c4c2c5a5ab737220b3abd116e327f3b2409ecea265250e86b7cf4
