Identifier: local.recipe.pkg.Firefox
Input:
  LATEST_RELEASE: LATEST_FIREFOX_VERSION
  LOCALE: en-US
  NAME: Firefox
  SOFTWARETITLE: Firefox
  VENDOR: Mozilla
ParentRecipe: com.github.rtrouton.pkg.Firefox
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.download.FirefoxSignedPkg:
      git_hash: b8ebd97b7fc92cc4a9dc382ccc2ff8090c1b8f21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/FirefoxSignedPkg.download.recipe
      sha256_hash: 63a854b014f941e7c6a24714eab91310ca0d40b91ab33e609724f24e918be53f
    com.github.rtrouton.pkg.Firefox:
      git_hash: b195cea242886d8350fcd06df3a0368e8a8dcd19
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/Firefox/Firefox.pkg.recipe
      sha256_hash: b0e97095f63138bbf4bcb53565280f956957b8871efd23c3f207588369fa5bc6
