Identifier: local.intune.Git
Input:
  DOWNLOAD_URL: https://sourceforge.net/projects/git-osx-installer/files/
  NAME: Git
  SEARCH_PATTERN: href="(https:\/\/sourceforge.net\/projects\/git-osx-installer\/files\/git-[\.\d]+-intel-universal-mavericks\.dmg\/download)"
  categories:
  - Productivity
  description: Git is a free and open source distributed version control system designed
    to handle everything from small to very large projects with speed and efficiency.
  developer: Tim Charper
  display_name: '%NAME%'
  icon_path: ''
ParentRecipe: com.github.almenscorner.intune.Git
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.almenscorner.intune-upload.processors/IntuneAppUploader:
      git_hash: 3490c79b8279cea017c399c16354e27edf040a28
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppUploader.py
      sha256_hash: 808212feb5e67a3af6fff5cfeec3c2392e6658badaa3b46f924ca8eea8b012c7
  parent_recipes:
    com.github.almenscorner.intune.Git:
      git_hash: fc2db2a38f3d6ba39670e7770ebbd93923084d7e
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/Git/Git.intune.recipe
      sha256_hash: b79d97519f34803d832c25e657ac7fce097ba2ecba4b1db55b203c23075d6d5b
    com.github.jleggat.Git.download:
      git_hash: 4b31dc37c8bc00f92ce38108e4fd73c5a85c0dd3
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jleggat-recipes/Git/Git.download.recipe
      sha256_hash: 0ce0cae0cb4b0b5cb2af963b760bfe11081e848147d3b74d6a3f154ca9a00d56
