Identifier: local.recipe.install.MicrosoftTeams
Input:
  NAME: Microsoft Teams
  SOFTWARETITLE: Teams
  VENDOR: Microsoft
  VERSIONTYPE: CFBundleShortVersionString
ParentRecipe: com.github.rtrouton.install.microsoftteams
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.rtrouton.download.microsoftteams:
      git_hash: 4dc821461da7d8570eb4a33eb8132cf63400122f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftTeams/MicrosoftTeams.download.recipe
      sha256_hash: 6c769df70a62c7751530dce3c5e6951aa131d76010d4fcc7611fe65be70c9a7f
    com.github.rtrouton.install.microsoftteams:
      git_hash: 41fbf3022d8bcccb5f3571930f3670d5c6235cca
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftTeams/MicrosoftTeams.install.recipe
      sha256_hash: 4fcfdc61b99814956480ea33cdf1f471b753ac7319fb3399b3bd6d64c09c5cc0
    com.github.rtrouton.pkg.microsoftteams:
      git_hash: 4dc821461da7d8570eb4a33eb8132cf63400122f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftTeams/MicrosoftTeams.pkg.recipe
      sha256_hash: 1e4db5a0364f3ea43ba3c0f883bec30e6612e47798052371d0bd41578beeecd3
