Identifier: local.jamf.PowerShell-Universal
Input:
  CATEGORY: Development
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  INSTALL_BUTTON_TEXT: Install
  MAJOR_VERSION: '7.2'
  NAME: PowerShell
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_RUN_COMMAND: ' '
  POLICY_TEMPLATE: PolicyTemplate.xml
  REINSTALL_BUTTON_TEXT: Install
  SELF_SERVICE_DESCRIPTION: PowerShell Core is a cross-platform (Windows, Linux, and
    macOS) automation and configuration tool/framework that works well with your existing
    tools and is optimized for dealing with structured data (e.g. JSON, CSV, XML,
    etc.), REST APIs, and object models. It includes a command-line shell, an associated
    scripting language and a framework for processing cmdlets.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SOFTWARE_TITLE: '%NAME%'
  UPDATE_PREDICATE: pkg_uploaded == False
ParentRecipe: local.jamf.PowerShell-Universal
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.mlbz521.SharedProcessors/XPathParser:
      path: ''
      sha256_hash: PROCESSOR FILEPATH NOT FOUND
    com.github.mlbz521.SharedProcessors/XarExtractSingleFile:
      path: ''
      sha256_hash: PROCESSOR FILEPATH NOT FOUND
    com.github.smithjw.processors/FriendlyPathDeleter:
      git_hash: c26a799a9933074405c283ed2041d94cebab027f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/SharedProcessors/FriendlyPathDeleter.py
      sha256_hash: 0b6bd25a9286ce875da80ca2a8e61bdb59b79214d5d1e5f465eab14b5d607e6c
  parent_recipes:
    com.github.smithjw.download.PowerShell-Universal:
      git_hash: 8328b6b74465c2557b13391f87393e6ddd8b0caa
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/PowerShell/PowerShell-Universal.download.recipe.yaml
      sha256_hash: 1163866318504357a0328a8c124771e8b4f112f9b02e2c049f405371f077bb8b
    com.github.smithjw.jamf.PowerShell-Universal:
      git_hash: 8328b6b74465c2557b13391f87393e6ddd8b0caa
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/PowerShell/PowerShell-Universal.jamf.recipe.yaml
      sha256_hash: 29d91f695932948f047d6e95953f47e33e856378fa1647db94527f8f0daff7e3
    com.github.smithjw.pkg.PowerShell-Universal:
      git_hash: 8328b6b74465c2557b13391f87393e6ddd8b0caa
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/PowerShell/PowerShell-Universal.pkg.recipe.yaml
      sha256_hash: 23083b5bddc748a62af68c17e14efa0b20b0761de7a1145a54be87b3d6ed4b60
    local.jamf.PowerShell-Universal:
      git_hash: 9d9a83b60fa63e45f30993a8a928391a7b18506d
      path: ~/work/macos-autopkg-factory/macos-autopkg-factory/recipe_overrides/PowerShell-Universal.jamf.recipe.yaml
      sha256_hash: 742d205df481ead04566011c17d6dc0b317f83fc8b99f0a67e943de56d771d0a
