Identifier: local.pkg.Thunderbird
Input:
  LOCALE: en_US
  NAME: Thunderbird
  RELEASE: latest
ParentRecipe: local.pkg.Thunderbird
ParentRecipeTrustInfo:
  non_core_processors:
    MozillaURLProvider:
      git_hash: a28e56e90ebc52512a4b7ec8fe1981bf02e92bc5
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/MozillaURLProvider.py
      sha256_hash: c4ce035b1a629c4925a80003899fcf39480e5224b3015613440f07ab96211f17
  parent_recipes:
    com.github.autopkg.download.thunderbird:
      git_hash: 211530ceb2453d6388015eca8a43773aaeb4eb5e
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Thunderbird.download.recipe
      sha256_hash: 55706422a0641b55d9695e6ff6997234a600527ac8e7020ca9cf306434b58de9
    com.github.autopkg.pkg.Thunderbird:
      git_hash: b8ebd97b7fc92cc4a9dc382ccc2ff8090c1b8f21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Thunderbird.pkg.recipe
      sha256_hash: 53ab0ca7148ad892e08daaf7ab942042c92d30d3fdcf68b3757873d3d8385b99
    local.pkg.Thunderbird:
      git_hash: f90d2413410c90103dd232e5735076259e5e9922
      path: ~/work/macos-autopkg-factory/macos-autopkg-factory/recipe_overrides/Thunderbird.pkg.recipe.yaml
      sha256_hash: 9abab952b86b7924f6fef8064b35965f5e9d9f130058c1be7cdebc76c3f6ffa1
