Identifier: local.intune.Vagrant
Input:
  DOWNLOAD_ARCH: arm64
  NAME: Vagrant
  categories:
  - Productivity
  description: Create and configure lightweight, reproducible, and portable development
    environments.
  developer: HashiCorp
  display_name: Vagrant
ParentRecipe: local.intune.Vagrant
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.almenscorner.intune-upload.processors/IntuneAppUploader:
      git_hash: 3490c79b8279cea017c399c16354e27edf040a28
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/IntuneUploader/IntuneAppUploader.py
      sha256_hash: 808212feb5e67a3af6fff5cfeec3c2392e6658badaa3b46f924ca8eea8b012c7
    io.github.hjuutilainen.SharedProcessors/HashiCorpURLProvider:
      git_hash: eaaafaaeb569c06a0e88be2417632dd87a4e6d4d
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/SharedProcessors/HashiCorpURLProvider.py
      sha256_hash: bdd17e58d9cf0c0c300372934de40ab77bd2231432d88711de0a1abedfd7e12d
  parent_recipes:
    com.github.almenscorner.intune.Vagrant:
      git_hash: 8a6debd45a1e91d4712f3703679ff8c09765bd49
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.almenscorner-recipes/HashiCorp/Vagrant.intune.recipe
      sha256_hash: d8f6626f4d79f7da80ed5a823b791747143a6f4e4c8b15eb970025e2d193ee08
    io.github.hjuutilainen.download.Vagrant:
      git_hash: eaaafaaeb569c06a0e88be2417632dd87a4e6d4d
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/HashiCorp/Vagrant.download.recipe
      sha256_hash: d29157b92e8abc9bdbed31fdf0f20006fbff3f138fd44b7cab3011288fc4f7c6
    local.intune.Vagrant:
      git_hash: f90d2413410c90103dd232e5735076259e5e9922
      path: ~/work/macos-autopkg-factory/macos-autopkg-factory/recipe_overrides/Vagrant.intune.recipe.yaml
      sha256_hash: 96286826c2690c04b30b4a89f45fe833d4d8b79e21c98cc1a32647cf9f3c9f7f
