Identifier: local.yaml.recipe.jamf-upload.Webex
Input:
  JAMF_CATEGORY: Business
  JAMF_PKG_INFO: One app for everything. And everyone. Calling, meetings, messaging,
    and events in the cloud for teams of all sizes.
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_NOTES: Generated and uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  NAME: Webex
  url: https://binaries.webex.com/webex-macos-apple-silicon/Webex.dmg
ParentRecipe: com.github.davidbpirie.jamf-upload.Webex
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      git_hash: febfabb5d43579197a98dd738b85840321c2a369
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95
  parent_recipes:
    com.github.davidbpirie.jamf-upload.Webex:
      git_hash: 3e997e344a348ec8afb8e1624cf4e269a82fcbdc
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.davidbpirie-recipes/Webex/Webex.jamf-upload.recipe.yaml
      sha256_hash: 25f5a13f77e83b016ef51e6b94be18df8d3da69dd16a64cd66230663b6e35465
    com.github.precursorca.download.Webex:
      git_hash: b69f7e6774c9a3b6b34b9688bd8c28a75cd6b76f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.precursorca-recipes/Cisco/Webex.download.recipe
      sha256_hash: aee92a7198d28237af4158e3ba51d31e2ea837dcf5367a9e998dd42bfcb14b2d
    com.github.precursorca.pkg.Webex:
      git_hash: cb260c53913b7902b7f394a62c7fd78ef08104f7
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.precursorca-recipes/Cisco/Webex.pkg.recipe
      sha256_hash: cdc5bf70dd5172965d1d173d57dc433b3f505f43a4e25f1dee7e7699f87f9da6
